[NoCoverage] BlockStatement
src/main.ts:4:28
 import { NestFactory } from '@nestjs/core';
 import { AppModule } from './app.module';
 
-async function bootstrap() {
-  const app = await NestFactory.create(AppModule);
-  await app.listen(process.env.PORT ?? 3001);
-}
+async function bootstrap() {}
 bootstrap();
 

[NoCoverage] LogicalOperator
src/main.ts:6:20
 
 async function bootstrap() {
   const app = await NestFactory.create(AppModule);
-  await app.listen(process.env.PORT ?? 3001);
+  await app.listen(process.env.PORT && 3001);
 }
 bootstrap();
