[NoCoverage] BlockStatement
src/payments/payment.controller.ts:9:61
   constructor(private readonly paymentService: PaymentService) {}
 
   @Post()
-  create(@Body() body: { orderId: string; amount: number }) {
-    return this.paymentService.createPayment(body.orderId, body.amount);
-  }
+  create(@Body() body: { orderId: string; amount: number }) {}
 
   @Get()

[NoCoverage] BlockStatement
src/payments/payment.controller.ts:14:13
   }
 
   @Get()
-  findAll() {
-    return this.paymentService.getPayments();
-  }
+  findAll() {}
 }
