[Killed] BlockStatement
src/payments/payment.service.ts:8:87
 export class PaymentService {
   private payments: Payment[] = [];
 
-  createPayment(orderId: string, amount: number): { status: 'APPROVED' | 'DECLINED' } {
-    const id = Date.now().toString();
-    const status = Math.random() > 0.5 ? 'APPROVED' : 'DECLINED';
-    const payment: Payment = { id, orderId, amount, status };
-    this.payments.push(payment);
-    return { status };
-  }
+  createPayment(orderId: string, amount: number): { status: 'APPROVED' | 'DECLINED' } {}
 
   getPayments(): Payment[] {
killedBy: PaymentService should create payment and return APPROVED when random > 0.5
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Killed] EqualityOperator
src/payments/payment.service.ts:10:20
 
   createPayment(orderId: string, amount: number): { status: 'APPROVED' | 'DECLINED' } {
     const id = Date.now().toString();
-    const status = Math.random() > 0.5 ? 'APPROVED' : 'DECLINED';
+    const status = Math.random() >= 0.5 ? 'APPROVED' : 'DECLINED';
     const payment: Payment = { id, orderId, amount, status };
     this.payments.push(payment);
killedBy: PaymentService should create payment and return DECLINED when random = 0.5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "DECLINED"
Received: "APPROVED"

[Killed] EqualityOperator
src/payments/payment.service.ts:10:20
 
   createPayment(orderId: string, amount: number): { status: 'APPROVED' | 'DECLINED' } {
     const id = Date.now().toString();
-    const status = Math.random() > 0.5 ? 'APPROVED' : 'DECLINED';
+    const status = Math.random() <= 0.5 ? 'APPROVED' : 'DECLINED';
     const payment: Payment = { id, orderId, amount, status };
     this.payments.push(payment);
killedBy: PaymentService should create payment and return APPROVED when random > 0.5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "APPROVED"
Received: "DECLINED"

[Killed] BlockStatement
src/payments/payment.service.ts:16:28
     return { status };
   }
 
-  getPayments(): Payment[] {
-    return this.payments;
-  }
+  getPayments(): Payment[] {}
 }
killedBy: PaymentService should create payment and return APPROVED when random > 0.5
statusReason: TypeError: Cannot read properties of undefined (reading 'length')
